<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"be0b7e389156805b7163b543268e033503681f9973ad44e037887d4616a8e20b","plan_job_ref":"Job Staging Environment #91 at https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/9572382970","plan_out_hash":"a977ae2842ff6c25820a75181784615e646b39e6ba5cba6d166a9d4a696f76b2","plan_hash":"78e955bf92a993cd681f732090b23897ddb747e705c272e1d84c857fa721e61a","plan_text_format":"diff","version":"1.43.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 0 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site-iam-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site-iam-policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::dev-portfolio-website-2.0",
+               "arn:aws:s3:::dev-portfolio-website-2.0/*",
            ]
+           sid       = "Allowing Cloudfront to access private S3 Bucket"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ",
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "EOUIG3G6N7CQQ"
        tags                            = {}
#        (23 unchanged attributes hidden)

!~      viewer_certificate {
!~          cloudfront_default_certificate = false -> true
#            (4 unchanged attributes hidden)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site-bucket-policy will be updated in-place
!~  resource "aws_s3_bucket_policy" "site-bucket-policy" {
        id     = "dev-portfolio-website-2.0"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "AWS:SourceArn" = "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::dev-portfolio-website-2.0/*",
-                           "arn:aws:s3:::dev-portfolio-website-2.0",
                        ]
-                       Sid       = "Allowing Cloudfront to access private S3 Bucket"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # aws_s3_object.cert will be updated in-place
!~  resource "aws_s3_object" "cert" {
!~      etag                          = "0138c9a0267bb7ee55ade1cbd15749d3" -> "73b6ddb3002ad239d1e22c29dcf1cd99"
        id                            = "cert.html"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.main-css will be updated in-place
!~  resource "aws_s3_object" "main-css" {
!~      etag                          = "cb39428849a303571053b6596736992c" -> "a8191c6bf09f2ea7170ba1fa89f0751f"
        id                            = "main.css"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

  # aws_s3_object.object will be updated in-place
!~  resource "aws_s3_object" "object" {
!~      etag                          = "de045234f66b9909fa2a4d63ea268098" -> "ca00a81a73acc565f2de6aed905954ee"
        id                            = "index.html"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (24 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Environment #91](https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/9572382970)